[Killed] MethodCallRemoval
:47:9
         private readonly string $tipo,
         array $linhas,
     ) {
-        $this->validarTipo();
+        
         $this->validarLinhas($linhas);
         $this->linhas = $linhas;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_invalido_quando_criado_entao_sistema_rejeita
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_invalido_quando_criado_entao_sistema_rejeita
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 15, Assertions: 16, Failures: 1.

[Killed] MethodCallRemoval
:48:9
         array $linhas,
     ) {
         $this->validarTipo();
-        $this->validarLinhas($linhas);
+        
         $this->linhas = $linhas;
     }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_sem_linhas_quando_criado_entao_sistema_rejeita
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_sem_linhas_quando_criado_entao_sistema_rejeita
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 14, Assertions: 14, Failures: 1.

[Killed] LogicalNot
:56:9
 
     private function validarTipo(): void
     {
-        if (!in_array($this->tipo, self::TIPOS_VALIDOS, strict: true)) {
+        if (in_array($this->tipo, self::TIPOS_VALIDOS, strict: true)) {
             throw new \DomainException('Tipo de documento inválido');
         }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_tem_1_linha
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_tem_1_linha
DomainException: Tipo de documento inválido

C:\wamp64\www\rafe\app\Modules\POS\Domain\DocumentoFiscal.php:57
C:\wamp64\www\rafe\app\Modules\POS\Domain\DocumentoFiscal.php:47
C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:32

ERRORS!

[Killed] Throw_
:57:13
     private function validarTipo(): void
     {
         if (!in_array($this->tipo, self::TIPOS_VALIDOS, strict: true)) {
-            throw new \DomainException('Tipo de documento inválido');
+            new \DomainException('Tipo de documento inválido');
         }
     }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_invalido_quando_criado_entao_sistema_rejeita
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_invalido_quando_criado_entao_sistema_rejeita
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 15, Assertions: 16, Failures: 1.

[Killed] Throw_
:64:13
     private function validarLinhas(array $linhas): void
     {
         if (empty($linhas)) {
-            throw new \DomainException('Documento fiscal não pode ser criado sem linhas');
+            new \DomainException('Documento fiscal não pode ser criado sem linhas');
         }
     }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_sem_linhas_quando_criado_entao_sistema_rejeita
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_sem_linhas_quando_criado_entao_sistema_rejeita
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 14, Assertions: 14, Failures: 1.

[Killed] PublicVisibility
:70:5
 
     // ─── Consultas ────────────────────────────────────────────────────────────
 
-    public function tipo(): string
+    protected function tipo(): string
     {
         return $this->tipo;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_fatura_recibo_quando_criado_entao_tipo_e_fatura_recibo
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_tipo_fatura_recibo_quando_criado_entao_tipo_e_fatura_recibo
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::tipo() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:175

ERRORS!
Tests: 11, Assertions: 10, Errors: 1.

[Killed] PublicVisibility
:80:5
      *
      * @return LinhaVenda[]
      */
-    public function linhas(): array
+    protected function linhas(): array
     {
         return $this->linhas;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_com_3_linhas_quando_devolvidas_entao_sao_exactamente_3
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_documento_com_3_linhas_quando_devolvidas_entao_sao_exactamente_3
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::linhas() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:335

ERRORS!
Tests: 21, Assertions: 27, Errors: 1.

[Killed] PublicVisibility
:88:5
     /**
      * Número de linhas distintas no documento.
      */
-    public function totalLinhas(): int
+    protected function totalLinhas(): int
     {
         return count($this->linhas);
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_tem_1_linha
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_tem_1_linha
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::totalLinhas() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:37

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
:99:5
      * Soma dos subtotais com desconto de todas as linhas (sem imposto).
      * total ilíquido = Σ subtotalComDesconto por linha
      */
-    public function totalIliquido(): float
+    protected function totalIliquido(): float
     {
         return array_reduce(
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::totalIliquido() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:49

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] UnwrapArrayReduce
:101:9
      */
     public function totalIliquido(): float
     {
-        return array_reduce(
-            $this->linhas,
-            fn(float $soma, LinhaVenda $linha) => $soma + $linha->subtotalComDesconto(),
-            0.0
-        );
+        return 0.0;
     }
 
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
Failed asserting that 0.0 matches expected 300.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:49

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Plus
:103:13
     {
         return array_reduce(
             $this->linhas,
-            fn(float $soma, LinhaVenda $linha) => $soma + $linha->subtotalComDesconto(),
+            fn(float $soma, LinhaVenda $linha) => $soma - $linha->subtotalComDesconto(),
             0.0
         );
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
Failed asserting that -300.0 matches expected 300.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:49

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] OneZeroFloat
:104:13
         return array_reduce(
             $this->linhas,
             fn(float $soma, LinhaVenda $linha) => $soma + $linha->subtotalComDesconto(),
-            0.0
+            1.0
         );
     }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iliquido_e_300
Failed asserting that 301.0 matches expected 300.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:49

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
:111:5
     /**
      * Soma do IVA de todas as linhas que NÃO têm retenção.
      */
-    public function totalIva(): float
+    protected function totalIva(): float
     {
         return array_reduce(
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::totalIva() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:61

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] LogicalNot
:116:17
         return array_reduce(
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
-                if (!$linha->temRetencao()) {
+                if ($linha->temRetencao()) {
                     return $soma + $linha->valorImposto();
                 }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
Failed asserting that 0.0 matches expected 42.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:61

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Plus
:117:21
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
                 if (!$linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
+                    return $soma - $linha->valorImposto();
                 }
                 return $soma;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
Failed asserting that -42.0 matches expected 42.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:61

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] ReturnRemoval
:117:21
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
                 if (!$linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
+                    
                 }
                 return $soma;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
Failed asserting that 0.0 matches expected 42.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:61

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] OneZeroFloat
:121:13
                 }
                 return $soma;
             },
-            0.0
+            1.0
         );
     }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_iva_e_42
Failed asserting that 43.0 matches expected 42.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:61

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
:129:5
      * Soma da retenção de todas as linhas que TÊM retenção.
      * Valor informativo — não entra no valor a pagar.
      */
-    public function totalRetencao(): float
+    protected function totalRetencao(): float
     {
         return array_reduce(
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_retencao_e_zero
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_retencao_e_zero
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::totalRetencao() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:73

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.

[Killed] UnwrapArrayReduce
:131:9
      */
     public function totalRetencao(): float
     {
-        return array_reduce(
-            $this->linhas,
-            function (float $soma, LinhaVenda $linha): float {
-                if ($linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
-                }
-                return $soma;
-            },
-            0.0
-        );
+        return 0.0;
     }
 
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
Failed asserting that 0.0 matches expected 325.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:145

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Killed] IfNegation
:134:17
         return array_reduce(
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
-                if ($linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
-                }
+                if (!$linha->temRetencao()) {
+                    return $soma + $linha->valorImposto();
                 return $soma;
             },
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_retencao_e_zero
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_total_retencao_e_zero
Failed asserting that 42.0 matches expected 0.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:73

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] Plus
:135:21
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
                 if ($linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
+                    return $soma - $linha->valorImposto();
                 }
                 return $soma;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
Failed asserting that -325.0 matches expected 325.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:145

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Killed] ReturnRemoval
:135:21
             $this->linhas,
             function (float $soma, LinhaVenda $linha): float {
                 if ($linha->temRetencao()) {
-                    return $soma + $linha->valorImposto();
+                    
                 }
                 return $soma;
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_multiplas_linhas_quando_criado_entao_total_retencao_e_325
Failed asserting that 0.0 matches expected 325.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:145

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Killed] PublicVisibility
:148:5
      * valor a pagar = total ilíquido + total IVA
      * Retenção NÃO soma — é informativa no documento.
      */
-    public function valorAPagar(): float
+    protected function valorAPagar(): float
     {
         return $this->totalIliquido() + $this->totalIva();
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_valor_a_pagar_e_342
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_valor_a_pagar_e_342
Error: Call to protected method App\Modules\POS\Domain\DocumentoFiscal::valorAPagar() from scope Tests\Unit\POS\Domain\DocumentoFiscalTest

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:85

ERRORS!
Tests: 5, Assertions: 4, Errors: 1.

[Killed] Plus
:150:9
      */
     public function valorAPagar(): float
     {
-        return $this->totalIliquido() + $this->totalIva();
+        return $this->totalIliquido() - $this->totalIva();
     }
 }
killedBy: Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_valor_a_pagar_e_342
statusReason: 1) Tests\Unit\POS\Domain\DocumentoFiscalTest::dado_fatura_com_uma_linha_com_iva_quando_criado_entao_valor_a_pagar_e_342
Failed asserting that 258.0 matches expected 342.0.

C:\wamp64\www\rafe\tests\Unit\POS\Domain\DocumentoFiscalTest.php:85

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.
