[Killed] PublicVisibility
:38:5
      * @param float $valorEntregue Valor que o cliente entregou
      * @return int ID do documento gerado
      */
-    public function finalizar(int $idPedido, string $tipoDocumento, string $metodoPagamento, float $valorEntregue): int
+    protected function finalizar(int $idPedido, string $tipoDocumento, string $metodoPagamento, float $valorEntregue): int
     {
         $pedido = $this->pedidoRepo->buscarPorId($idPedido);
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
Error: Call to protected method App\Modules\POS\Services\FinalizarVendaService::finalizar() from scope Tests\Unit\POS\Services\FinalizarVendaServiceTest

C:\wamp64\www\rafe\tests\Unit\POS\Services\FinalizarVendaServiceTest.php:80

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
:41:9
     public function finalizar(int $idPedido, string $tipoDocumento, string $metodoPagamento, float $valorEntregue): int
     {
         $pedido = $this->pedidoRepo->buscarPorId($idPedido);
-        if ($pedido === null) {
+        if ($pedido !== null) {
             throw new \DomainException('Pedido não pode estar vazio');
         }
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
DomainException: Pedido não pode estar vazio

C:\wamp64\www\rafe\app\Modules\POS\Services\FinalizarVendaService.php:42
C:\wamp64\www\rafe\tests\Unit\POS\Services\FinalizarVendaServiceTest.php:80

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
:42:13
     {
         $pedido = $this->pedidoRepo->buscarPorId($idPedido);
         if ($pedido === null) {
-            throw new \DomainException('Pedido não pode estar vazio');
+            new \DomainException('Pedido não pode estar vazio');
         }
 
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_ao_tentar_finalizar_pedido_sem_itens
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_ao_tentar_finalizar_pedido_sem_itens
Failed asserting that exception of type "Error" matches expected exception "DomainException". Message was: "Call to a member function itens() on null" at
C:\wamp64\www\rafe\app\Modules\POS\Services\FinalizarVendaService.php:47
C:\wamp64\www\rafe\tests\Unit\POS\Services\FinalizarVendaServiceTest.php:94

[Killed] Foreach_
:47:9
 
         // Criar LinhasVenda a partir dos ItemPedido do Pedido
         $linhasVenda = [];
-        foreach ($pedido->itens() as $item) {
-            $linhasVenda[] = new \App\Modules\POS\Domain\LinhaVenda(
-                $item->idProduto(),
-                $item->descricao(),
-                $item->quantidade(),
-                $item->preco(),
-                $item->desconto(),
-                $item->imposto()
-            );
-        }
+        foreach ([] as $item) {
 
         $documento = new \App\Modules\POS\Domain\DocumentoFiscal($tipoDocumento, $linhasVenda);
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
DomainException: Documento fiscal não pode ser criado sem linhas

C:\wamp64\www\rafe\app\Modules\POS\Domain\DocumentoFiscal.php:75
C:\wamp64\www\rafe\app\Modules\POS\Domain\DocumentoFiscal.php:49
C:\wamp64\www\rafe\app\Modules\POS\Services\FinalizarVendaService.php:58
C:\wamp64\www\rafe\tests\Unit\POS\Services\Fin

[Killed] Foreach_
:64:13
         return $this->transacao->executar(function () use ($pedido, $documento, $metodoPagamento, $valorEntregue) {
             
             // Abater stock (isto lança excepção se não houver stock suficiente)
-            foreach ($pedido->itens() as $item) {
-                // Se a nossa Base de Dados levantasse erro aqui, fariamos catch para relançar
-                // com a mensagem "Stock insuficiente no momento do checkout" se aplicável.
-                // Mas o FakeStockRepositorio vai lançar \DomainException('Quantidade insuficiente em stock').
-                // Para cumprir o requisito exacto de BDD:
-                try {
-                    $this->stockRepo->subtrair($item->idProduto(), $item->quantidade());
-                } catch (\DomainException $e) {
-                    throw new \DomainException('Stock insuficiente no momento do checkout');
-                }
-            }
+            foreach ([] as $item) {
 
             // Guardar documento
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
:70:21
                 // Mas o FakeStockRepositorio vai lançar \DomainException('Quantidade insuficiente em stock').
                 // Para cumprir o requisito exacto de BDD:
                 try {
-                    $this->stockRepo->subtrair($item->idProduto(), $item->quantidade());
+                    
                 } catch (\DomainException $e) {
                     throw new \DomainException('Stock insuficiente no momento do checkout');
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] Throw_
:72:21
                 try {
                     $this->stockRepo->subtrair($item->idProduto(), $item->quantidade());
                 } catch (\DomainException $e) {
-                    throw new \DomainException('Stock insuficiente no momento do checkout');
+                    new \DomainException('Stock insuficiente no momento do checkout');
                 }
             }
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_por_stock_insuficiente_no_momento_do_checkout
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
:80:13
             $idDocumento = $this->documentoRepo->salvar($documento);
 
             // Registar pagamento (Isto pode lançar \DomainException('Falha simulada no registo de pagamento.'))
-            $this->pagamentoRepo->registar($idDocumento, $valorEntregue, $metodoPagamento);
+            
 
             // Eliminar o pedido agora que foi convertido
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_na_atomicidade_por_erro_de_pagamento_mantem_estado_intacto
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::falha_na_atomicidade_por_erro_de_pagamento_mantem_estado_intacto
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
:83:13
             $this->pagamentoRepo->registar($idDocumento, $valorEntregue, $metodoPagamento);
 
             // Eliminar o pedido agora que foi convertido
-            $this->pedidoRepo->eliminar($pedido->idPedido());
+            
 
             return $idDocumento;
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
Failed asserting that App\Modules\POS\Domain\Pedido Object #396 (
    'itens' => Array &0 [
        0 => App\Modules\POS\Domain\ItemPedido Object #529 (
            'idProduto' => 10,
            'descricao' => 'Prod 10',
            'quantidade' => 2,
            'preco' => 500.0,

[Killed] ReturnRemoval
:85:13
             // Eliminar o pedido agora que foi convertido
             $this->pedidoRepo->eliminar($pedido->idPedido());
 
-            return $idDocumento;
+            
         });
     }
killedBy: Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
statusReason: 1) Tests\Unit\POS\Services\FinalizarVendaServiceTest::sucesso_ao_finalizar_uma_venda
TypeError: App\Modules\POS\Services\FinalizarVendaService::finalizar(): Return value must be of type int, null returned

C:\wamp64\www\rafe\app\Modules\POS\Services\FinalizarVendaService.php:86
C:\wamp64\www\rafe\tests\Unit\POS\Services\FinalizarVendaServiceTest.php:80

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
